pmo-dataset/variations/mermaid_with_ids/49.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Customer brings a\ndefective computer"]
	Task_2["CRS checks the\ndefect"]
	Task_3["CRS hands out a\nrepair cost\ncalculation"]
	Task_4["Client takes her\ncomputer home\nunrepaired"]
	Task_5["Check the hardware"]
	Task_6["Check the software"]
	Task_7["Proper system\nfunctionality is\ntested"]
	Task_8["Repair is finished"]
	Task_9["Repair the hardware"]
	Task_10["Configure the\nsoftware"]
	StartNoneEvent_1((" "))
	EndNoneEvent_1((" ")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}

	StartNoneEvent_1 --> Task_1
	Task_1 --> Task_2
	Task_2 --> Task_3
	Task_3 --> ExclusiveGateway_1
	ParallelGateway_1 --> Task_5
	ParallelGateway_1 --> Task_6
	Task_8 --> ExclusiveGateway_4
	Task_5 --> Task_9
	Task_7 --> ExclusiveGateway_2
	Task_6 --> Task_10
	ParallelGateway_2 --> Task_7
	ExclusiveGateway_3 --> ParallelGateway_1
	Task_9 --> ParallelGateway_2
	Task_10 --> ParallelGateway_2
	ExclusiveGateway_4 --> EndNoneEvent_1
	Task_4 --> ExclusiveGateway_4
	ExclusiveGateway_1 -->|"costs are not\nacceptable"| Task_4
	ExclusiveGateway_1 -->|"costs are acceptable"| ExclusiveGateway_3
	ExclusiveGateway_2 -->|"error is detected"| ExclusiveGateway_3
	ExclusiveGateway_2 -->|"no error"| Task_8
